Tekla.Structures.ModelInternal.Operation.ExportIFCFromAll(System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from all objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromSelected(System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from selected objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromObjects(System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from given objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ModelObjects:  List of model objects to export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromFilteredObjects(System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from filtered objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
FilterName:  Filter file name for model objects to export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportDgnFromAll(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,System.String,System.Int32@,System.Int32@,System.String@)
Dgn export from all objects.
FileName:  The file name.
Folder:  The folder.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
ObjectColoring: Defines which object coloring filter is to be used in export.
ExportLayersAs: Defines which report field to use for layers export.
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export.
userName: Current user user name
Returns: int, defines the final run state.

Tekla.Structures.ModelInternal.Operation.ExportDgnFromSelected(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,System.String,System.Int32@,System.Int32@,System.String@)
Dgn export from selected objects.
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
ObjectColoring: Defines which object coloring filter is to be used in export.
ExportLayersAs: Defines which report field to use for layers export.
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state

Tekla.Structures.ModelInternal.Operation.ExportDwgFromAll(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,System.String,System.Int32@,System.Int32@,System.String@)
Dwg export from all objects.
FileName:  The file name.
Folder:  The folder.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
ObjectColoring: Defines which object coloring filter is to be used in export.
ExportLayersAs: Defines which report field to use for layers export.
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state.

Tekla.Structures.ModelInternal.Operation.ExportDwgFromSelected(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,System.String,System.Int32@,System.Int32@,System.String@)
Dwg export from selected objects.
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
ObjectColoring: Defines which object coloring filter is to be used in export.
ExportLayersAs: Defines which report field to use for layers export.
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state

Tekla.Structures.ModelInternal.Operation.ExportRevitFromAll(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.Int32@,System.Int32@,System.String@)
Revit export from all objects.
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state.

Tekla.Structures.ModelInternal.Operation.ExportRevitFromSelected(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.Int32@,System.Int32@,System.String@)
Revit export from selected objects.
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
BasePoint: Defines which base point is used in export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
exportedObjects: Number of objects successfully exported.
exportFailedObjects: Number of objects that failed to export
userName: Current user user name
Returns: int, defines the final run state

Tekla.Structures.ModelInternal.Operation.ExportIFC(System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},System.String,System.Boolean,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)


Tekla.Structures.ModelInternal.Operation.DoExportDgn(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,System.String,System.Boolean,System.Int32@,System.Int32@,System.String@)


Tekla.Structures.ModelInternal.Operation.DoExportDwg(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,System.String,System.Boolean,System.Int32@,System.Int32@,System.String@)


Tekla.Structures.ModelInternal.Operation.DoExportRevit(System.String,System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.Boolean,System.Int32@,System.Int32@,System.String@)


Tekla.Structures.ModelInternal.Operation.dotSaveModel(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotSaveAsModel(System.String,System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotAutoSaveModel(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotQuitProgram(System.String,System.String)


Tekla.Structures.ModelInternal.Operation.dotSharingWriteOut(Tekla.Structures.ModelInternal.Operation.DotSharingPrivilegeEnum,System.String,Tekla.Structures.ModelInternal.Operation.DotSharingWriteOutModeEnum,System.String,Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum@,System.String@,System.Collections.Generic.Dictionary{System.String,System.Tuple{System.String,System.String}}@)
The dot sharing write out.
permission: User permission.
packetFolder: Full path to the folder that contains all the files that will be included in the write out file.
mode: The write out mode.
revisionInfo:
The revision information as xml.
My comment
My code
myemail@tekla.com
My Name
errorCode: The Error Code in case the write-out failed.
errorDetail: Detail for the error
moduleBaselines: The module baselines, tuples of old baseline and new baseline.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.Operation.dotSharingWriteOutCommit(System.Boolean,System.String,System.Int32,Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum@,System.String@,System.Collections.Generic.Dictionary{System.String,System.Tuple{System.String,System.String}}@)
The dot sharing write out commit.
success: True if write out was successful so commit to be done, if false uncommit to be done.
packetFolder: Full path to the folder that contains all the files that will be included in the write out file.
packetNumber: The packet number.
errorCode: The Error Code in case the write-out failed.
errorDetail: Detail for the error
moduleBaselines: The module baselines, tuples of old baseline and new baseline.
Returns: Commit/uncommit result.